var MOCKED_Poetes_DATA = [


{id : 1 , title: ' أعلام الشعر العربي الحديث', 'historique': 'جمع هذا العصر خلاصة الأساليب الشّعرية من العصور السّابقة جميعها، فنجد شاعراً ينظم الشّعر الحرّ بينما في مواضع أخرى ينظم الشّعر التقليدي. تجد عند قراءة الشّعر أنّ الشّاعر الحديث مشدود إلى أمّته يشارك في آلامها وأفراحها، كما أنّه يكاد يكون كلّ شاعر يتخصّص بنوع من الحوادث يُعرف بها، فهناك مفدي زكريا شاعر الثّورة الجزائرية، والشّابي ممثّل الكفاح التّونسي، والمهداوي ممثّل الكفاح اللّيبي، البارودي ممثّل الكفاح المصريّ قبل دخول الإنجليز، وغيرهم ', 'image' :'../../../images/alhadith/background.jpg',
poetes :[
{
  'Nom' :'إبراهيم طوقان' ,
   'Image' :'../../../images/alhadith/ibrahimtou9an.jpg',
   'Historique' :'ولد في عام 1905م في محافظة نابلس في فلسطين، ودرس فيها المرحلة الابتدائية، ومن ثمّ أكمل دراسته في القدس، وفي مرحلة الدراسة الثانوية تأثّر بالشعر العربي، واللغة العربية، وسافر إلى بيروت ليُكمل دراسته الجامعيّة، وحصل على شهادةٍ في الآداب، وفي عام 1936م عمل في قسم اللغة العربية في إذاعة القدس، ويُعتبر من الشعراء الفلسطينيين المشهورين، ومن أشهر قصائده: موطني، وتوفّي في عام 1941م',
   'poeme' :[
     {
       'Titre' :'aaa',
       'contenu' :'aaaaa'
     }
   ]
},
]}
,{id : 2 , title: 'شعراء المعلقات ',
 'historique': 'يمكن تعريف المعلّقات بأنها تلك القصائد الطويلة التي كتبها شعراء العصر الجاهلي، وقد سميت بالمعلقات للعديد من الأسباب منها أنها كانت تعلّق على ستار الكعبة وذلك لأهميتها، ومنهم من قال أنّ سبب التسمية هو أنّ المعلّقات كانت تعلّق في نفوس الناس وعقولهم وهو السبب الأرجح. وتعتبر المعلّقات من أهم ما كتبه شعراء العصور القديمة، وتجلّت فيها خصائص الشعر الجاهلي بوضوح كبير. كما ويبلغ عدد المعلّقات سبع معلّقات وفي مقولة أخرى يقال بأنّ عددها عشر معلّقات، إلّا أنّ الرأي الراجح أكثر هو أنّ عددها سبع معلّقات وتمّ إضافة ثلاث معلّقات ليصبح عددها عشر معلّقات. ',
  'image' :'../../../images/alhadith/background.jpg',
poetes :[
{
  'Nom' :'امرئ القيس' ,
   'Image' :'../../../images/almoualkat/ImruLkays.jpg',
   'Historique' :' وهو امرؤ القيس بن حجر بن الحارث بن عمرو، ويعتبر أحد شعراء الطبقة الأولى وأشهر شعراء العرب على الإطلاق، يعود أصله إلى اليمن، وقال الشعر وهو صغير، كما وقد اهتم المستشرقون الغربيون بدراسة وشرح المعلقات كافّة ومعلقة امرؤ القيس خاصّة بل ودرسوا حياته وتعمقوا في سيرته. وقد فُقد له كثير من الأشعار، وكان على دين الوثنية، أمّا مطلع معلقته المهشورة هي: قفا نبكِ من ذكرى حبيبٍ ومنزلٍ بسِقط اللوى بين الدَّخولِ فحوملِ ',
   'poeme' :[
     {
       'Titre' :'aaa',
       'contenu' :'aaaaa'
     }
   ]
},
{
  'Nom' :'طرفة بن العبد ' ,
   'Image' :'../../../images/almoualkat/ImruLkays.jpg',
   'Historique' :'وهو طرفة بن العبد بن سفيان بن سعد بن عدنان، اشتُهر بشعر الهجاء، ويقال أنّ أصله من البحرين، وعاش طرفة بن العبد يتيماً وعانى من ظلم أعمامه، فكانت حياته مليئة بالبؤس. وتميّزت معلّقته بالحس الإنساني الذي لم يكن له مثيل في شعر الجاهلية، ومطلع معلقة طرفة بن العبد ',
   'poeme' :[
     {
       'Titre' :'aaa',
       'contenu' :'aaaaa'
     }
   ]
},





]},
,{id : 3 , title: 'العباسيون ', 'historique': 'جمع هذا العصر خلاصة الأساليب الشّعرية من العصور السّابقة جميعها، فنجد شاعراً ينظم الشّعر الحرّ بينما في مواضع أخرى ينظم الشّعر التقليدي. تجد عند قراءة الشّعر أنّ الشّاعر الحديث مشدود إلى أمّته يشارك في آلامها وأفراحها، كما أنّه يكاد يكون كلّ شاعر يتخصّص بنوع من الحوادث يُعرف بها، فهناك مفدي زكريا شاعر الثّورة الجزائرية، والشّابي ممثّل الكفاح التّونسي، والمهداوي ممثّل الكفاح اللّيبي، البارودي ممثّل الكفاح المصريّ قبل دخول الإنجليز، وغيرهم ', 'image' :'../../../images/alhadith/background.jpg',
poetes :[
{
  'Nom' : ' أبو فراس الحمداني'   ,
   'Image' :'../../../images/poetes/alabassi/aboufirass.jpeg',
   'Historique' :'  هو الحارث بن سعيد بن حمدان الحمداني، يرجع أصله إلى قبيلة تغلب، ولد عام 320 هـ، قُتل أبوه وهو في الثالثة من عمره، وبهذا، تربّى أبو فراس على يد أمّه وبرعايه ابن عمّه سيف الدولة الحمداني، الذي حالما أصبح حاكماً لحلب، اصطحبه معه ل0حترف الأدب والفروسيّة والعلم.'
   'poeme' :[
     {
       'Titre' :'aaa',
       'contenu' :'aaaaa'
     }
   ]
},
{
  'Nom' : 'أبو الطيب المتنبي '   ,
   'Image' :'../../../images/poetes/alabassi/almoutanabi.jpg',
   'Historique' :' أحمد بن الحسين الجعفي، والمعروف باسم أبو الطيب، عاش في الدولة العباسية إيّام ضعفها، وُلِد في الكوفة عام 303هـ، ونسبه يعود إلى قبيلة كندة في الكوفة. كان شديد الفخر بنفسه وأصله وعائلته، وهذا الأمر قد ظهر جليّاً في شعره. اختار المتنبي أغلب علاقاته لتكون من طبقة الأمراء والخلفاء ليمدحهم ويحصل منهم على المغانم والمرتبة العالية، إلا أنّ ما كان يشغله هو ان يكون والياً على إحدى ولايات الدولة العبّاسية، وعلى أثر هذه الرحلة الهادفة التي قام بها بين الأمراء، انتهى به الأمر في السجن. وقد ترك السجن أثراً سيئاً في نفسية المتنبي إلا أنّه لم يتخلَّ عن طموحه الذي قاده واوصله إلى سيف الدولة الحمداني. شعر المتنبي أن سيف الدولة هو المفتاح الذي سيحقق له آماله، وعليه، نجد المتنبي وقد أصبح ذراع سيف الدولة الأيمن، يشاركه في غزواته، ويمدح خصاله، ويُدوّن انتصاراته وبطولاته في ساحة المعركة، إذ نجد أنّ سيف الدولة قد احتلّ ثلث مجمل شعر المتنبي. ومن خلال سيف الدولة استطاع المتنبي أن ينعم بعيش رغيد وحياة مريحة، الأمر الذي جعل الكثير من الشعراء يحيكون له المكائد ليسقط ، وبعد محاولات طويلة، نحجوا في إيقاع الخلاف بين المتنبي سيف الدولة، فرحل عن حلب وهو يعاتبه في شعره على تصديقهم. اتجه المتنبي بعد خروجه من حلب إلى مصر، وهناك وصل إلى قصر كافور حاكم الدولة الإخشيدية، فأخذ يمدحه ويُعلي من شأنه، إلا أنّه كان شديد الصراحة في التعبير عن مراده بتولّي الولايه، فاستطاع أعداؤه الإيقاع به، فهرب من بطش كافور وهو يهجوه هجاءً لاذعاً. وخرج من مصر متّجهاً إلى بعداد، وهناك امتنع عن مدح عضد الدولة، فغضب عليه وأرسل أبا جهل الأسدي ليقتله، واستطاع المتنبي أن يهرب بعد أن تقاتلا، إلا أن غلامه عاتبه قائلاً: أتهرب وأنت القائل الخيل والليل والبيداء تعرفني...والسيف والرمح والقرطاس والقلم؟! فرد عليه المتنبي: قتلتني قتلك الله، فرجع المتنبي وقاتل حتى قُتل هو وغلامه، عن عمر قارب واحد وخمسين عاماً.'
     {
       'Titre' :'aaa',
       'contenu' :'aaaaa'
     }
   ]
},
{
  'Nom' : 'أبو العلاء المعري '   ,
   'Image' :'../../../images/poetes/alabassi/almaari.jpg',
   'Historique' :'وُلد أبو العلاء أحمد بن عبد الله المعرّي في معرَّة النعمان عام 363هـ وإليها يُنسب، تربّى في بيت علم وفضل؛ فجدّه كان قاضياً، ووالده شاعراً، أخواه شاعرَيْن أيضاً. أُصيب بمرض الجدري وهو في الثالثة من عمره، ففقد عينه إثر ذلك، ولم تلبث أن لحقت بها عينه الأخرى، إلا أنّ هذا الأمر لم يُفقده عزيمته، فاّتجه بكل قوّته ينهل من ينابيع العلم، ويتحدّى ظروفه الصعبة، فانصرف إلى الأدب العربي، وفنون اللغة، والحديث الشريف، والقرآن الكريم، وعلوم اللغة والنحو، وغيرها من العلوم. تميّز بنبوغه وذكائه، وقدرته العالية على الحفظ، إذ كان قادراً على حفظ على يُروى عليه من مرة واحة، ولهذا انتقل إلى حلب ليتلقّى العلم من العلماء هناك، واتّجه بعدها إلى طرابلس لينهل من المكتبات ما استطاع، ثم وصل إلى أنطاكية. وتردّدت سمعته في البلاد ولمع نجمه، وأصبح من الشعراء والعلماء البارزين، مما أثار الحسّاد حواله، فأثاروا حوله عدداً م الفتن والتُّهم والإشاعات بالكفر والزّندقة، وقلبوا عله علماء الدين لكفره، إلا أنّه واجههم بالحزم والشّدة، ساخراً من جهلهم. على الرغم من أنّه اعتكف في منزله في آخر حياته، إلا أنّه لم يكن في معزل عن الحياة الاجتماعية، فقد فتح باب ليدخل إليها من يحتاجه، وتحوّل بيته بذلك إلى منارة للعلم يقصدها طلّاب العلم والأدب من كافة الأرجاء، ووزّعه يومه بين التعليم والعبادة والتأمّل. اعتلّ المعري في آخر حياته، ووهن جسده إلى أن توفّي عام 449هـ عن عمر يناهز 86 عاماً. '
     {
       'Titre' :'aaa',
       'contenu' :'aaaaa'
     }
   ]
},
{
  'Nom' : 'أبو نواس '   ,
   'Image' :'../../../images/poetes/alabassi/abounawess.jpg',
   'Historique' :'الحسن بن هانئ الحكمي الدمشقي، المُلقّب بأبي نُوَاس، وعُرف بشاعر الخمر. ولد لأب عربي وأم فارسية، ولمّا توفي أبوه انتقلب به أمه إلى الأهواز، لترسله أمّه بعدها وهو في السادسة من عمره ليعمل في الكُتّاب. تلقّى العلم على يد خلف الأحمر، الذي لم يسمح له بقول الشعر إلا بعد أن يحفظ مجموعة من شعر العرب، وما أن يحفظ أبو نواس الشعر الموكل إليه، يأمره خلف الأحمر بنسيانها؛ حتى لا يختلط عليه ما يقوله من الشعر وما حفظه، وهذه من أرفع أساليب تعليم الشعر. أصبح أبو نواس شاعراً عظيماً بوصوله سن الثلاثين من العمر، فألمّ بالأدب، وقواعد اللغة، والعلوم الإسلامية المتنوّعة: من قواعد القرآن، والحديث الشريف، والفقه. وقد طكح كغيره أن يصل إلى الأمراء والوُلاة ليمدحهم وينال عطاءَهم، إلا أننا نجد الخمر هو الموضوع الرئيس في ديواه الشعري. أحبّ في البصرة جارية تدعى (جَنان)، وتغنّى بها في كثير من شعره، ثم ارتحل إلى بغداد ومدح هارون الرشيد وتقرّب منه، لكن ما لبث هارون أن حبسه بسبب مجون شعره، ليعفو عنه في النهاية بشفاعة البرامكة له. اتّجه إلى مصر ليمدح والي الخراج فيها، فتحسّنت حاله واستقرّ أمره. بعد وفاة هارون الرشيد واستخلاف ابنه الأمين، عاد أبو نواسٍ إلى بغداد وتواصل معه، ليصبح نديم الأمين الأول، إلا أنّ سيرته وبذاءته جعلت منه حجّة لخصوم الأمين أن يثوروا عليه لمندامته شاعراً خليعاً كأبي نواس، فحبسه الأمين ردّاً على أعدائه. إلا أن العلاقة لم تنتهِ بينهما، إذ ما لبث الأمين أن توفّي، فرثاه أبو نواس بقصائد تكشف صدق عاطفته ومشاعره. توفّي أبو نواسٍ عام 195هـ قبل دخول المأمون إلى بغداد، وقد أختلف المؤرّخون على تحديد مكان وفاته وسببها '
     {
       'Titre' :'aaa',
       'contenu' :'aaaaa'
     }
   ]
},
{
  'Nom' : 'ابن الرومي '   ,
   'Image' :'../../../images/poetes/alabassi/ibnroumi.jpg',
   'Historique' :' أبو الحسن، علي بن العباس، ولد في بغداد عام 221هـ ، روميّ الأصل من أمّ فارسية، اهتمّ بالشعر منذ نعومة أظفاره. كانت حياته كئيبة ومرّة، تعكس المآسي والمصائب التي عاشها. تنوّعت موضوعات شعره بين المديح، والهجاء، والرثاء، وكان ذا مكانة كبيرة بين شعراء عصره، إلا أنّه لم يكن محبوباً، وذلك بسبب كثرة المصائب التي عاشها من احتراق قريته ونفاد المحاصيل الزراعية، ومات بعدها معظم أفراد أسرته، وهم: والده، ووالدته، وأخيه، وخالته، ثم زوجته، وأولاده الثلاثة. امتزجت الأغراض الشعرية لديه ببعضها البعض، فأدخل الفخر مع المدح، وربط المدح بالشكوى والأنين من مصاب الدنيا، وكان دائم الذكر للموت، شديد اللهجة عند الهجاء. إلا أنّه تميّز بالرثاء ووصف الطبيعة. توفي عام 283هـ مسموماً على يد وزير الإمام المعتضد خوفاً من أن يهجوه '
     {
       'Titre' :'aaa',
       'contenu' :'aaaaa'
     }
   ]
}






]},
{id : 4 , title: 'الفاطميون' '', 'historique': 'جمع هذا العصر خلاصة الأساليب الشّعرية من العصور السّابقة جميعها، فنجد شاعراً ينظم الشّعر الحرّ بينما في مواضع أخرى ينظم الشّعر التقليدي. تجد عند قراءة الشّعر أنّ الشّاعر الحديث مشدود إلى أمّته يشارك في آلامها وأفراحها، كما أنّه يكاد يكون كلّ شاعر يتخصّص بنوع من الحوادث يُعرف بها، فهناك مفدي زكريا شاعر الثّورة الجزائرية، والشّابي ممثّل الكفاح التّونسي، والمهداوي ممثّل الكفاح اللّيبي، البارودي ممثّل الكفاح المصريّ قبل دخول الإنجليز، وغيرهم ', 'image' :'../../../images/alhadith/background.jpg',
poetes :[
{
  'Nom' :'إبراهيم طوقان' ,
   'Image' :'../../../images/alhadith/ibrahimtou9an.jpg',
   'Historique' :'ولد في عام 1905م في محافظة نابلس في فلسطين، ودرس فيها المرحلة الابتدائية، ومن ثمّ أكمل دراسته في القدس، وفي مرحلة الدراسة الثانوية تأثّر بالشعر العربي، واللغة العربية، وسافر إلى بيروت ليُكمل دراسته الجامعيّة، وحصل على شهادةٍ في الآداب، وفي عام 1936م عمل في قسم اللغة العربية في إذاعة القدس، ويُعتبر من الشعراء الفلسطينيين المشهورين، ومن أشهر قصائده: موطني، وتوفّي في عام 1941م',
   'poeme' :[
     {
       'Titre' :'aaa',
       'contenu' :'aaaaa'
     }
   ]
},
]},
{id : 5 , title: 'المماليك ', 'historique': 'جمع هذا العصر خلاصة الأساليب الشّعرية من العصور السّابقة جميعها، فنجد شاعراً ينظم الشّعر الحرّ بينما في مواضع أخرى ينظم الشّعر التقليدي. تجد عند قراءة الشّعر أنّ الشّاعر الحديث مشدود إلى أمّته يشارك في آلامها وأفراحها، كما أنّه يكاد يكون كلّ شاعر يتخصّص بنوع من الحوادث يُعرف بها، فهناك مفدي زكريا شاعر الثّورة الجزائرية، والشّابي ممثّل الكفاح التّونسي، والمهداوي ممثّل الكفاح اللّيبي، البارودي ممثّل الكفاح المصريّ قبل دخول الإنجليز، وغيرهم ', 'image' :'../../../images/alhadith/background.jpg',
poetes :[
{
  'Nom' :'إبراهيم طوقان' ,
   'Image' :'../../../images/alhadith/ibrahimtou9an.jpg',
   'Historique' :'ولد في عام 1905م في محافظة نابلس في فلسطين، ودرس فيها المرحلة الابتدائية، ومن ثمّ أكمل دراسته في القدس، وفي مرحلة الدراسة الثانوية تأثّر بالشعر العربي، واللغة العربية، وسافر إلى بيروت ليُكمل دراسته الجامعيّة، وحصل على شهادةٍ في الآداب، وفي عام 1936م عمل في قسم اللغة العربية في إذاعة القدس، ويُعتبر من الشعراء الفلسطينيين المشهورين، ومن أشهر قصائده: موطني، وتوفّي في عام 1941م',
   'poeme' :[
     {
       'Titre' :'aaa',
       'contenu' :'aaaaa'
     }
   ]
},
]},
{id : 6 , title: '(عصور مختلفة)', 'historique': 'جمع هذا العصر خلاصة الأساليب الشّعرية من العصور السّابقة جميعها، فنجد شاعراً ينظم الشّعر الحرّ بينما في مواضع أخرى ينظم الشّعر التقليدي. تجد عند قراءة الشّعر أنّ الشّاعر الحديث مشدود إلى أمّته يشارك في آلامها وأفراحها، كما أنّه يكاد يكون كلّ شاعر يتخصّص بنوع من الحوادث يُعرف بها، فهناك مفدي زكريا شاعر الثّورة الجزائرية، والشّابي ممثّل الكفاح التّونسي، والمهداوي ممثّل الكفاح اللّيبي، البارودي ممثّل الكفاح المصريّ قبل دخول الإنجليز، وغيرهم ', 'image' :'../../../images/alhadith/background.jpg',
poetes :[
{
  'Nom' :'إبراهيم طوقان' ,
   'Image' :'../../../images/alhadith/ibrahimtou9an.jpg',
   'Historique' :'ولد في عام 1905م في محافظة نابلس في فلسطين، ودرس فيها المرحلة الابتدائية، ومن ثمّ أكمل دراسته في القدس، وفي مرحلة الدراسة الثانوية تأثّر بالشعر العربي، واللغة العربية، وسافر إلى بيروت ليُكمل دراسته الجامعيّة، وحصل على شهادةٍ في الآداب، وفي عام 1936م عمل في قسم اللغة العربية في إذاعة القدس، ويُعتبر من الشعراء الفلسطينيين المشهورين، ومن أشهر قصائده: موطني، وتوفّي في عام 1941م',
   'poeme' :[
     {
       'Titre' :'aaa',
       'contenu' :'aaaaa'
     }
   ]
},
]}



];


module.exports = MOCKED_Poetes_DATA ;
