
import React, { Component } from 'react';
import { connect } from 'react-redux';
import { Actions } from 'react-native-router-flux';
import { Container, Header, Title, Right,
List, ListItem,InputGroup, Input ,Picker,Badge,H3, Fab,Content, Card, CardItem, Thumbnail, Text, Button, Icon, Left, Body} from 'native-base';
import {Column as Col, Row} from 'react-native-flexbox-grid';
import { Image} from 'react-native' ;
import { openDrawer } from '../../../actions/drawer';
import styles from './styles';
const background = require('../../../../images/poemes/history.jpg');
import * as Animatable from 'react-native-animatable';


class PoemeEtapes extends Component {



  constructor(props) {


     super(props);


this.state={
  Article :{}
}


//console.log("Article is"+ this.articleRef.equalTo('Article1'));

}



//**********add to Favorites***********//

addFavorites()
{
  console.log("iic add to favorite");
}









//*****************************//

componentDidMount() {



}





  static propTypes = {
    name: React.PropTypes.string,
    index: React.PropTypes.number,
    list: React.PropTypes.arrayOf(React.PropTypes.string),
    openDrawer: React.PropTypes.func,
  }

  render() {
    const { props: { name, index, list } } = this;

    return (
      <Container style={styles.container}>
        <Header>
          <Left>
            <Button transparent onPress={() => Actions.pop()}>
              <Icon name="ios-arrow-back" />
            </Button>
          </Left>

          <Body>
<Animatable.Text animation="zoomIn">
            <Title>{(name) ? this.props.name : 'الشعر العربي '}</Title>
</Animatable.Text>
          </Body>

          <Right>
            <Button transparent onPress={this.props.openDrawer}>
              <Icon name="ios-menu" />
            </Button>
          </Right>
        </Header>

        <Content padder>

        <Card >
       <CardItem>


                                       <Body>
                                           <Text style={{fontSize :20,
                                           fontWeight :'bold',textAlign:'center'}}> تعريف الشعر العربي </Text>
      </Body>

                                 </CardItem>
                                 <CardItem cardBody>
                                      <Image source={background} style={{width: 400, height: 400}}/>
                                 </CardItem>
      </Card>


      <Card>


      <CardItem header>
      <Right>
      <Text style={{
      fontWeight :'bold',textAlign:'center'}}>مراحل تطور الشعر العربي </Text>
      </Right>
      </CardItem>


      <CardItem>
      <Body>
      <List>
                         <ListItem>
                          <Text>
                          مِن المعروف أنّ الشعر القديم يختلفُ اختلافاً كلّياً عن الشعر في الوقت الحاضر، وأهمّ ما يميّز الشعر القديم حِرصهِ على الوزن والقافية، وتكوّن البيت على الصدر والعَجز، والشعر القديم الذي لا يدخلُ فيهِ الوزن والقافية لا يعتبرُ شِعراً، بل يخرج إلى الخَطابة أو فصاحةِ فِي الحديث، وبعد ذلكَ ظهرت الكتب التي تقوم على تدريسِ الأوزان والقوافي ليعتمد عليها الشعراء فِي إبداعِ النصوص واستخراجِ أبياتٍ موزونة، وبعد ذلك ظهرَ كتب أخرى تقوم على جمعِ وتدوينِ وتصنيفِ الشعر إلى مجموعاتٍ بالاعتمادِ على أغراضِ وموضوعاتِ الشعر، وعليه، نجد المؤرخون قد اعتبروا الشعر القديم حافلاً لغرضِ الامتاعِ والنفعِ بنقلِ المشاعر أو الحكمة أو لأي غرض ذو قيمة، فَهو مصدرَ طرب لدى العرب، يحمل فيه الأخلاق العربية، ويُعبّر عن الانتماء والحب.


</Text>
                         </ListItem>


                         </List>
      </Body>
      </CardItem>
      </Card>









      <Card>


      <CardItem header>
        <Right>
      <Text style={{
      fontWeight :'bold',textAlign:'center',color :'#2196F3'}}>الشعر الجاهلي </Text>
      </Right>
      </CardItem>


      <CardItem>
      <Body>

        <List>
                        <ListItem>
                      <Text>
                      كان الشعر قديماً يُعرف بالقصيدة المكوّنة من أبيات، كل بيت فيها مُستَقِل عمّا قبله وبعده في التركيب، وتتّصل الأبيات معاً في المعنى، يتألف البيت من شطرين، يُسمى الأول صدراً والثاني عجزاً، وتنتهي أبيات القصيدة جميعها بحرف واحد يُسمى القافية، تمتاز بموسيقا محدّدة تتحدّد بالبحر العروضي المُتّبع. وقد عُرف الشعر الجاهلي في هذا العصر بالشِّعر التقليدي أو الكلاسيكي .
</Text>
                        </ListItem>

<ListItem>
<Text>
عبّر الشعر الجاهلي عن أسلوب الحياة العربية ، وصوّرها بِدقّة عالية عكس فيها أوجه الحياة المتعدّدة، ولهذا سُمّي بـ (ديوان العرب)، أي إنّه الموسوعة التي تحتوي كل الأخبار والقصص، فنجد فيه وَصْفَ الخِيام، والرحلة، ووصف الحيوانات، ورحلات الصيد، والحروب ، كما نجد المدح، والغزل، والهجاء ، الرثاء. وقيل إنّ أفضل القصائد التي كتبها العرب هي تلك التي كُتبت بماء الذّهب وعُلّقت على جدار الكعبة.
</Text>
</ListItem>


<ListItem>
<Text>
بدأت القصيدة الجاهلية بالمقدمة الطللية التي يقف فيها الشاعر على الأطلال، فيبكي على الديار الخالية، ويصف الآثار التي خلت من أحبّائه بعد رحيلهم، ثمّ يصف الرحلة، وعناء السفر، ومعالم الطريق، ووحوش الصحراء وحيوانها وغيرها، لينتقل يعدها إلى الغزل بذكر المحبوبة والتّغني بجمالها وأخلاقها، وقد يذكر بعض المغامرات التي عاشها معها قبل رحيلها، وتنتهي هذه القصيدة إلى الموضوع الرئيس الذي يريد أن يتحدّث عنه الشاعر، وقد يكون مديحاً، أو فخراً، أو، حماسةً، أو هجاءً، أو تعصّباً لقبيلته، أو غيرها
</Text>
</ListItem>


<ListItem>
<Text>
من أشهر شعراء العصر الجاهلي هم أصحاب المعلّقات السبعة، وقيل العشرة، وهم، امرؤ القيس، وطرفة بن العبد، وزهير بن أبي سلمى، ولبيد بن ربيعة، وعمرو بن كلثوم، وعنترة بن شدّاد، والحارث بن حلزة، والأعشى، والنابغة الذبياني، وعبيد بن الأبرص

</Text>
</ListItem>



                        </List>
        </Body>
      </CardItem>
      </Card>





                                 <Card>


                                 <CardItem header>
                                  <Right>
                               <Text style={{
                               fontWeight :'bold',textAlign:'left',color :'#2196F3'}}>شِعر صدر الإسلام</Text>
                               </Right>
                                </CardItem>


                                <CardItem>

                                   <Body>
                                     <List>


                                     <ListItem >
                                <Text>
                                ارتبط الشّعر الإسلامي بظهور الدّعوة الإسلاميّة التي حملها الرّسول محمد عليه السلام، وعليه، تجد الشعراء استبسلوا في الجهاد بشعرهم لنصرة الدين الجديد، ومحاربة أعدائهم بالشعر، والفخر بالنبي عليه السلام وهجاء قريش وتسجيل الغزوات. ومن خيرة هؤلاء الشعراء نذكر حسان بن ثابت، وعبد الله بن رواحة، وكعب بن مالك، وكعب بن زهير.
</Text>
                                     </ListItem>

      <ListItem >
<Text>
على المستوى اللغويّ، فإننا نجد اللغة المُستخدمَة واضحة وسهلة وليّنة، بعيدة عن الغرابة والغموض والرموز المُبهَمة، وتستند إلى أبعاد تاريخيّة دينية، فهي لغة أع الدلالية في الدين والسياسة والاجتماع والتاريخ والطبيعة والتصوف والأدب والذات والموضوع
</Text>
      </ListItem>





      </List>



                                     </Body>
                                 </CardItem>
      </Card>







                                       <Card>


                                       <CardItem header>
                                        <Right>
                                     <Text style={{
                                     fontWeight :'bold',textAlign:'left',color :'#2196F3'}}>الشعر الأموي </Text>
                                     </Right>
                                      </CardItem>


                                      <CardItem>

                                         <Body>
                                           <List>

<ListItem >
<Text>ازدهر الشعر في العصر الأمويّ واتسعت مواضيعه، وتطوّرت أساليبه، وأصبحت معانيه وألفاظه أكثر رقّة ولطافة مماشاةً لحالة العصر الجديد، والمظاهر السياسية، والدينية، والثقافية؛ فقد ظهرت الخلافات السياسيّة، والقَبَلية، والمذهبية، وقد خاض حرب هذه الأحداث الشعراء، وتحيّز كل شاعر إلى جماعته يدافعون عنهم وينشرون أفكارهم ومفاهيمهم، ويمكننا القول أن الشعراء والأُدباء عامّةً كانوا يُمثّلون الصحافة المحلية لتلك العصور العربية القديمة.
</Text>
</ListItem>

        <ListItem>
      <Text>
        مّا بالنسبة للموضوعات الشعرية فقد كان من الطبيعي أن تتوسع وتزداد في هذا العصر، خاصّةً بعد الانكماش الذي لحقها في عصر صدر الإسلام الذي ركّز كل اهتمامه على الدعوة الإسلامية، فقد نظم الشعراء في هذا العصر في مواضيع كثيرة في الشعر منها ما كانت موجودة من قبل في الجاهلية والإسلام، فتوسّعوا فيها وأكثروا منها، ومنها ما هو جديد ابتكروه استناداً على ظروف الحياة ومتطلباتها، ومنها ما كان له أثر من الجاهلية والإسلام، فأضافوا عليها وعدّلوا قواعدها حتى جعلوها غرضاً مُستقلاً بحدّ بذاته، كالفخر، والمدح، والهجاء، والوصف، والغزل، والخمريّات، والنقائض.
</Text>
        </ListItem>



        <ListItem>
        <Text>
        من أشهر شعراء العصر الأموي نذكر الأخضل، والفرزدق، وجرير (شعراء النقائض)، وبشار بن برد، والمُقنّع الكندي، شعراء الغزل العذري كجميل بثينة، وقيس ليلى، ومجنون لبنى، وغيرهم الكثيرين


        </Text>
        </ListItem>





            </List>



                                           </Body>
                                       </CardItem>
            </Card>





            <Card>


            <CardItem header>
             <Right>
          <Text style={{
          fontWeight :'bold',textAlign:'left',color :'#2196F3'}}>الشعر العباسي </Text>
          </Right>
           </CardItem>


           <CardItem>

              <Body>
                <List>

<ListItem >
<Text>
طورت الأساليب الشعرية في العصر العباسي بسبب اطّلاع الشعراء على الثّقافات الأجنبية التي وسّعت مداركهم، وزادت من معلوماتهم، إلى جانب تطّور الحياة الحضارية. فنجد أن الشعراء قد مالوا إلى الأساليب السهلة والمفهومة المنسوجة من واقع الحياة، وابتعدوا عن الألفاظ الصعبة التي قلّ استعمالها أو هُجِرت، واعتمدوا على المُحسّنات البديعية، والتجديد في الألفاظ تبعاً لتطّور الأمور، حتى وصلت الحال عند مجموعة من الشعراء إلى استخدام ألفاظ غير عربية في الشعر. وعليه، يمكننا أن نقول أن مفهوم الأسلوب يعني الطريقة السلوكية التي يعتمدها الشاعر في شعره، بيحث كان لكل شاعر أو مجموعة من الشعراء تلك الطريقة التي عُرفوا بها.
</Text>
</ListItem>

<ListItem>
<Text>
قد نظم شعراء الدولة العباسية الأساليب الشعرية في ضوء حضارة الدولة وثقافتها، وطريقة تذوقها للفنون، لذا جاء الأسلوب الشعري أقرب من يكون إلى الرقّة في النسج، والدقة في التّصوير، وشاعت في الحواشي ألوان من الزخرفة اللفظيّة، والصنعة اللغوية، إضافة إلى النغمة الموسيقية التي تحرّك المشاعر والوجدان. وعليه، نجد أن الشعراء كلّما كانوا أكثر تحضراً مالوا إلى الزينة والاطافة في كل شيء، فالطّابع الحضري تغشاه الأناقة في كل جوانبه، وهو ما يدلّ على التطور في الأذواق، الرّقي في الأفكار، ورقيها، وهو السبب الذي دفع بالشعر إلى إيجاد أسلوب جديد تركن فيه النفس لتستريح عند جماله وتناسقه ورقّته. من أشهر شعراء العصر العباسي نذكر المتنبي، والأصمعي، وأبا فراس الحمداني، وأبا العلاء المعرّي، وأبا نواس، وابن الرومي، وابن الفارض، وأبا العتاهية، وغيرهم من الشعراء


</Text>
</ListItem>









</List>



                </Body>
            </CardItem>
</Card>






<Card>


<CardItem header>
 <Right>
<Text style={{
fontWeight :'bold',textAlign:'left',color :'#2196F3'}}>الشعر الأندلسي  </Text>
</Right>
</CardItem>


<CardItem>

  <Body>
    <List>

<ListItem >
<Text>
ظهر الشعر الأندلسي في ظروف جديدة لا مثيل لها في المشرق العربي، ظروف اتّصلت بالطبيعة الأندلسية وتنوُّعها، وأخرى اتّصلت بالتّكوين الثقافي السّكاني، إذ نرى العرب يختلطون لأول مرة مع أجناس لاتينيَّة، وقوطيّة، وبربريَّة، إضافة إلى اليهود على أرض واحدة، وتتعايش كل هذه الأجناس تحت سماء واحدة تضمّ الأديان السماوية الثلاثة: الإسلام، واليهودية، والمسيحيَّة، فيُسمع صوت المؤذن إلى جانب رنين الأجراس. وتُستخدم اللغة العربية إلى جانب الأمازيغية، والإسبانية، والكتلانية، فنشأ من التعايش بين هذه الأديان والأجناس والثقافات واللغات جوٌّ خاص وحضارة فذَّة رائعة.

</Text>
</ListItem>

<ListItem>
<Text>
انساق الأندلسيون وراء أهل المشرق في أغراض الشعر التقليدية، كما في الوصف، ورثاء الممالك، والشكوى، والاستنجاد، وقد أكثروا من الوصف حتى أننا نستطيع أن نستخلص من شعرهم صورة واضحة للحياة الأندلسية في شتّى نواحيها، فوصفوا الأندلس بما فيها من مدن، ومتنزّهات، وعجائب العمارة، والأودية، والجبال، والبساتين، والرياض، والأزهار، والثمار، والافصول الأربعة، والبحيرات، والسواقي. كما وصفوا الولائم الملكية، والأطعمة، والزينة، والعطور، والملابس، والموسيقا، إضافة إلى اللهو والمجون. وهكذا نجد التنوّع والتجديد في فن الوصف
</Text>
</ListItem>

<ListItem>
<Text>
وإذا أردنا التحدّث عن اللغة الأندلسية فإنّنا نجدها سهلة، سلسة، غير محكمة البناء كلغة المشرق، وذلك يعود إلى بعد الأندلس عن البادية ولغتها القاسية، واختلاط العرب في بيئة أعجمية تمتلئ باللهجات واللغات الأخرى التي أضعفت ملكتهم ورَقَّقَت تعابيرهم. ومع كل هذه العوامل في تلطيف اللغة الأندلسية فإننّا نجد بعض الصعوبة في شعر ابن هانئ، مثلاً، الذي عمد إلى تقليد المتنبي، فانصرف في شعره إلى اختيار الغريب والخشونة والتعقيد. أما بالحديث عن الأوزان الشعرية، فقد تبع فيها الأندلسيون أهل المشرق، إلا أنّهم عمدوا في الغالب إلى الموسيقا، فأضافوا أوزانا جديدة ساعدت على إضافة اللحن الموسيقي في الشعر، الذي تحوّل فيما بعد إلى شعر خاص بالغناء عُرف باسم الموشحات
</Text>
</ListItem>


<ListItem>
<Text>
من أشهر الشعراء والوشاحين اخترنا أبا البقاء الرُّندي، وابن حمديس، ولسان الدين الخطيب، وولّادة بنت المستكفي، وعبادة بن ماء السماء، وابن خفاجة، والمعتمد بن عبّاد، وغيرهم الكثير
</Text>
</ListItem>






</List>



    </Body>
</CardItem>
</Card>




<Card>


<CardItem header>
 <Right>
<Text style={{
fontWeight :'bold',textAlign:'left',color :'#2196F3'}}>الشعر العثماني  </Text>
</Right>
</CardItem>


<CardItem>

  <Body>
    <List>

<ListItem >
<Text>
واجهَت الدولة العثمانية طوال فترة حكمها الكثير من المشكلات والصّعوبات، خاصّة الأمنية منها، والسعي إلى نشر الأمان بين أطراف الدولة المترامية، فعاشت الدولة الكثير من الانقلابات السياسية، وحركات التّمرد، فانشغل الحُكـّام بقمعها وإعادة الأمور إلى مجاريها، ومن الجدير بالذكر أن ذلك الإصلاح السياسي كان على حساب إهمال المرافق العامة، وتأجيل تنفيذ المشروعات الإصلاحية وإنعاش الحياة المدنية، ناهيك عن التدهور الصِّحي الذي عمَّ مختلف الأرجاء، الأمر الذي رافقه إهمال بناء المدارس، والتشجيع على الانخراط في الجيش، وقمع المواهب والقدرات العقلية، وإلغاء الجانب الثقافي والأدبي. فعاشت القصيدة العربية في هذه الأجواء بالاعتماد على القوالب التراثية، فنشأ الشعر البديعي الذي يخلو من المعنى، ولكن يمتاز بتركيبة بديعية عالية، ونزح الشعراء عن الحياة ولجأ الأغلب إلى الشعر الصوفي، وكثرت المدائح النبوية، والمراثي، والملاحم، والقصص الشعرية الركيكة.
</Text>
</ListItem>

<ListItem>
<Text>
اعتمدت القصيدة على الوحدة، إذ إنّ هناك أنواع مُتعدّدة للوحدة في القصيدة العربية في العصر العثماني، تبدأ من وحدة البيت واستقلاليّته في الشكل العام، وانتقالاً إلى الوحدة المنطقيّة في التسلسل القصصي للشعر، انتهاءً بالوحدة الموضوعية خاصّة في المدائح النبوية، والمراثي. ولا ننس الحديث عن الوحدة الوجدانية النفسية في أجزاء القصيدة كلّها.
</Text>
</ListItem>

<ListItem>
<Text>
من أشهر شعراء العصر العثماني نذكرابن معتوق، وعبد الغني النابلسي، ومنجك اليوسفي، ويوسف البديعي، والبهاء العاملي، والتهانوي، وبدر الدِّين الغزي
</Text>
</ListItem>
</List>



    </Body>
</CardItem>
</Card>




<Card>


<CardItem header>
 <Right>
<Text style={{
fontWeight :'bold',textAlign:'left',color :'#2196F3'}}>الشعر الحديث </Text>
</Right>
</CardItem>


<CardItem>

  <Body>
    <List>

<ListItem>

<Text>
في سنةِ 1930م ظهرَ الشاعر أدونيس الذي يعتبر مِن أهمّ شعراءِ الحداثة لأنّهُ جمعَ بينَ الثقافة العربيّة الكلاسيكيّة والحديثة والمعاصرة، وبالتالي كان مِن أهمّ نقاد العرب والذي وضعَ أساسيّات شعر النثر التي ظهرت في زمانه وعلى يده، وأغلبِ ثقافاته كانت تبنى على الفلسفة والإبداع الشعري والمصرحي مِما جعل هذا اللون متاح وأضافهُ إلى عالمِ الشعر فِي الوطن العربي، ويعتبر كتاب أدونيس فِي الشعرية العربيّة لهُ مكانة مُهمّة في النقد الحديث والمُعاصر، وهذا الأمر قَد طوّر الشعر من القافية والوزن إلى النثر وعلومَه.
</Text>
</ListItem>


<ListItem>

<Text>
أمّا فِي الوقت الحالي تغيّرَ الشعر العربي عمّا كانَ سابقاً ليصبحَ عبارة عن شعر حُر تتجسّد كلماتهُ باستخدامِ مفرداتٍ وكلماتٍ لها مَعنى ومغزى عظيم، وهذا النوع منَ الشعر قد إنتشرَ كبيراً خصيصاً بينَ أهم شعراءِ العصر الحديث ليتغنّى بهِ الشاعر مِن خلال إلقاء هذهِ الكلمات المُعبّرة سواء كانت غزليّة أو شعبيّة أو سياسيّة ودينيّة، لذلكَ الشّعر العربي لهُ مكانةٍ عندَ الكثير منَ الناس ولا يُمكِن أن يُستغنى عَنِ الشعر فهوَ دائماً يصفّ إلى جانب الواقع والحقيقة وأيضاً المشاعر الخلاقة والنبيلة
</Text>
</ListItem>




</List>



    </Body>
</CardItem>
</Card>





        </Content>
      </Container>
    );
  }
}

function bindAction(dispatch) {
  return {
    openDrawer: () => dispatch(openDrawer()),
  };
}

/*const mapStateToProps = state => ({
  name: state.user.name,
  index: state.list.selectedIndex,
  list: state.list.list,
});*/

PoemeEtapes= Animatable.createAnimatableComponent(PoemeEtapes);
export default connect(null, bindAction)(PoemeEtapes);
